## Reto 3: Map

### 1. Objetivos:
    - Practicar el uso del método `map` para mapear un dato a otro dato que le corresponde.
    
---
    
### 2. Desarrollo:

#### a) Booleanos a numéricos

Vamos a trabajar sobre el dataset que guardaste en el Reto anterior. Esta vez tu Reto es muy sencillo:

1. La columna `is_potentially_hazardous_asteroid` tiene valores `booleanos`. Crea un diccionario de mapeo donde hagas un correspondencia de cada valor `booleano` con su equivalente numérico y transforma esa columna.
2. Usa una función para mapear la columna `relative_velocity.kilometers_per_hour` a una nueva columna llamada `relative_velocity.kilometers_per_minute`, que contenga la velocidad del objeto en kilómetros por minuto.
3. Guarda tu `DataFrame` resultante en la variable `df_reto_3`.
4. Guarda tu resultado en un archivo .csv.

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd

In [42]:
df_reto_3 = pd.read_csv('/content/drive/MyDrive/reto2.csv')

In [43]:
df_reto_3.head()

   Unnamed: 0  Unnamed: 0.1  ...       id                name
0           0             0  ...  2154652  154652 (2004 EP20)
1           1             1  ...  3153509           (2003 HM)
2           2             3  ...  3837644          (2019 AY3)
3           3             4  ...  3843493           (2019 PY)
4           4             5  ...  3765015         (2016 WR48)

[5 rows x 15 columns]

In [44]:
booleano = {
  True:int(1),
  False:int(0)
}

In [45]:
df_reto_3['is_potentially_hazardous_asteroid'] = df_reto_3['is_potentially_hazardous_asteroid'].map(booleano)

df_reto_3.head()

   Unnamed: 0  Unnamed: 0.1  ...       id                name
0           0             0  ...  2154652  154652 (2004 EP20)
1           1             1  ...  3153509           (2003 HM)
2           2             3  ...  3837644          (2019 AY3)
3           3             4  ...  3843493           (2019 PY)
4           4             5  ...  3765015         (2016 WR48)

[5 rows x 15 columns]

In [46]:
def km_min(value):
    
    return value/60

In [47]:
df_reto_3['relative_velocity.kilometers_per_minute'] = df_reto_3['relative_velocity.kilometers_per_hour'].map(km_min)

df_reto_3['relative_velocity.kilometers_per_minute']

0       968.571811
1       741.062629
2      1348.716917
3       299.921473
4       447.905361
          ...
296     928.485664
297     970.823503
298     906.368411
299    1220.590392
300    1783.945551
Name: relative_velocity.kilometers_per_minute, Length: 301, dtype: float64

In [49]:
df_reto_3.to_csv('/content/drive/MyDrive/reto3.csv',index=False)

Pídele a tu experta la función de verificación `revisar_resultados` (encontrada en el archivo `helpers.py` de la carpeta donde se encuentra este Reto), pégala debajo y corre la celda para verificar tu resultado:

In [48]:
# Pega aquí la función de verificación
def revisar_resultados(df_reto_3):
    
    import pandas as np
    import pandas.api.types as pdtypes
    
    assert pdtypes.is_int64_dtype(df_reto_3['is_potentially_hazardous_asteroid']), 'La columna "is_potentially_hazardous_asteroid" no ha sido transformada a tipo numerico'
    assert len(df_reto_3['is_potentially_hazardous_asteroid'].unique()) == 2, 'Hubo un error con la correspondencia de valores booleanos a numéricos. Hay más de dos valores posibles en la columna resultante'
    assert df_reto_3['relative_velocity.kilometers_per_minute'].equals(df_reto_3['relative_velocity.kilometers_per_hour'] / 60), 'La conversión de kilometros por hora a kilómetros por minuto no fue realizada correctamente'
    
    print(f'Todos los procesos fueron realizados exitosamente!')
    
revisar_resultados(df_reto_3)

Todos los procesos fueron realizados exitosamente!